app/controllers/incidents_controller.rb

  def create
    @incident = Incident.new(incident_params)
    @incident.set_user!(current_user)

    if @incident.media.url
      puts @incident.media.url
      puts "Test"
      num_faces = `python detect_faces.py #{@incident.media.url}`
      tag = num_faces + "(number of people)"
      @incident.set_tag!(tag)
    end

    respond_to do |format|
      if @incident.save
---
INSERT INTO "incidents" ("location", "severity", "time", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["location", "tisch"], ["severity", 3], ["time", "2000-01-01 01:01:01.000000"], ["user_id", 56], ["created_at", "2016-02-25 23:20:35.666156"], ["updated_at", "2016-02-25 23:20:35.666156"]]